{
  "metadata": {
    "title": "Thomas Tepi - Portfolio Développeur Web",
    "description": "Portfolio de Thomas Tepi présentant des projets de développement web, des compétences et de l'expérience en tant que développeur React.js et Node.js."
  },

  "header": {
    "home": "Accueil",
    "projects": "Projets",
    "aboutMe": "À propos",
    "contactMe": "Contact",
    "blog": "Blogues",
    "resume": "CV"
  },

  "landing": {
    "greeting": "Bonjour, je suis Thomas!",
    "title": "Développeur Full Stack | Défenseur de l'agriculture durable",
    "subTitle": "Créer des solutions numériques qui autonomisent les communautés locales et favorisent la durabilité environnementale.",
    "btnText": "Me contacter"
  },

  "alert": {
    "successHeader": "Message envoyé!",
    "errorHeader": "Oups!"
  },

  "contactMe": {
    "heading": "Envoyez-moi un message",
    "intro": "Une question, une idée de projet ou simplement envie de dire bonjour? Je serais ravi d’échanger avec vous. Remplissez le formulaire et je vous répondrai dans les plus brefs délais.",
    "required": "*",
    "optional": "(Facultatif)",
    "labels": {
      "name": "Votre Nom",
      "email": "Votre Email",
      "type": "De quoi s'agit-il?",
      "message": "Votre Message"
    },
    "placeholders": {
      "select": "-- Sélectionner --",
      "hireMe": "Collaboration sur un projet",
      "feedback": "Retour d’expérience",
      "other": "Juste un petit bonjour"
    },
    "buttons": {
      "send": "Envoyer"
    },
    "alerts": {
      "success": "{{name}}, j'ai bien reçu votre message et je vous contacterai bientôt. Un courriel de confirmation est en route vers votre boîte de réception.",
      "error": "Quelque chose s'est mal passé, veuillez réessayer plus tard!"
    },
    "validation": {
      "requiredName": "Le nom est requis.",
      "minName": "Le nom doit comporter au moins 2 caractères.",
      "maxName": "Le nom ne peut pas dépasser 100 caractères.",
      "invalidName": "Le nom ne peut contenir que des lettres, des espaces, des apostrophes et des traits d'union.",

      "requiredEmail": "L'adresse e-mail est requise.",
      "invalidEmail": "Veuillez saisir une adresse e-mail valide.",

      "invalidType": "Type de demande invalide.",

      "requiredComment": "Le message est requis.",
      "minComment": "Le message doit contenir au moins 25 caractères.",
      "maxComment": "Le message ne peut pas dépasser 1000 caractères.",
      "invalidCharacters": "Le message contient des caractères non valides.",
      "serverError": "Erreur interne du serveur. Veuillez réessayer plus tard.",
      "networkError": "Erreur réseau. Veuillez vérifier votre connexion Internet.",
      "timeoutError": "La requête a expiré. Veuillez réessayer plus tard."
    },
    "captchaFailed": "reCAPTCHA a échoué. Veuillez réessayer.",
    "recaptchaDisclaimer": "Protégé par reCAPTCHA. <privacy>Règles de confidentialité<ExternalLinkIcon /></privacy> | <tos>Conditions d’utilisation<ExternalLinkIcon /></tos>"
  },

  "aboutMe": {
    "heading": "À propos de moi",
    "paragraph1": "Je suis Thomas Tepi, développeur basé à Montréal et contributeur open source, spécialisé en React.js, Node.js et la création d’expériences web conviviales.",
    "paragraph2": "Je m'épanouis dans le développement de fonctionnalités, l'amélioration des interactions UI/UX et l'écriture de code clair et maintenable qui renforce la fonctionnalité et l'accessibilité des projets. Au-delà du développement, je suis également un défenseur des technologies durables et des solutions communautaires.",
    "paragraph3": "Mon expérience allie expertise technique et impact concret, que ce soit en développant des expériences numériques fluides ou en soutenant des initiatives qui autonomisent les communautés. Avec une solide base en collaboration et en résolution de problèmes, je suis déterminé à concevoir des technologies qui font la différence - aussi bien dans le numérique que dans le monde réel."
  },

  "techStack": {
    "techStackTitle": "Technologies",
    "techStackSubtitle": "Voici quelques-unes des technologies avec lesquelles j'ai de l'expérience:",
    "frontend": "Frontend",
    "backend": "Backend",
    "tools": "Outils"
  },

  "projects": {
    "heading": "Mes Projets",
    "MoreProjectsBtn": "Autres projets",
    "sawyerCamp": {
      "title": "Sawyer-Camp Farmers CIG",
      "description": "Développement d’une plateforme web moderne pour Sawyer Camp Farmers CIG au Cameroun, intégrant un AI Lab avec des outils d’aide à la décision agricole pour soutenir les agriculteurs locaux et promouvoir des pratiques durables.",
      "longDescription": "Plateforme web moderne et mobile-first dédiée à l’agriculture durable et au renforcement des capacités des agriculteurs. Le site intègre un AI Lab offrant des outils intelligents tels que l’AI Crop Planner pour la planification culturale et le Farm Doctor pour l’identification des maladies des cultures, tout en mettant en valeur les initiatives communautaires, les produits locaux et les opportunités de partenariat.",
      "features": [
        "Espace membres avec inscription et connexion pour renforcer l’engagement communautaire",
        "AI Lab avec outils agricoles intelligents (AI Crop Planner et Farm Doctor)",
        "AI Crop Planner : recommandations basées sur la région, la saison et les conditions culturales",
        "Farm Doctor : diagnostic des maladies des cultures à partir d’images et de descriptions",
        "Blog et actualités pour partager les initiatives de la communauté",
        "Dons en ligne sécurisés via PayPal avec prise en charge multi-devises",
        "Formulaires de contact et de demande avec validation",
        "Optimisation SEO avec métadonnées et images sociales"
      ],
      "contributions": [
        "Conception de l’architecture d’information et des parcours utilisateurs",
        "Développement d’une interface réactive, accessible et adaptée au mobile (WCAG, navigation clavier)",
        "Conception et intégration des outils IA agricoles (planification culturale et diagnostic)",
        "Mise en place d’un modèle de contenu de type CMS pour faciliter les mises à jour",
        "Configuration du déploiement, du DNS et de la mise en cache via CDN",
        "Implémentation du flux de dons PayPal reliant le frontend et le backend pour des paiements sécurisés"
      ],
      "tech": [
        "Next.js",
        "Node.js",
        "React",
        "Chakra UI",
        "OpenAI API",
        "Image CDN"
      ],
      "links": {
        "github": "https://github.com/thomastepi/sawyer-camp-next-app",
        "demo": "https://sawyercamp.thomastepi.com"
      },
      "meta": { "year": "2025", "status": "En ligne" }
    },

    "resumeBuilder": {
      "title": "Créateur et Analyseur de CV IA",
      "description": "Développé ResumeCraft, une plateforme propulsée par l’IA qui permet de créer des CV compatibles ATS, d’analyser des CV existants en PDF selon une offre d’emploi ciblée et de suivre les candidatures au même endroit.",
      "longDescription": "ResumeCraft est une plateforme complète d’optimisation de CV. Les utilisateurs peuvent créer des CV à partir de données de profil structurées, analyser des CV PDF existants en les comparant à des descriptions de poste spécifiques, recevoir des retours détaillés par section avec les mots-clés manquants, et gérer leurs candidatures grâce à un outil de suivi intégré.",
      "features": [
        "Authentification sécurisée et gestion des profils utilisateurs",
        "Création de CV assistée par IA avec modèles personnalisables et aperçu en temps réel",
        "Analyse de CV : importation de PDF et comparaison avec une offre d’emploi",
        "Commentaires détaillés par section avec analyse des mots-clés ATS manquants",
        "Suivi des candidatures avec gestion des statuts et des notes",
        "Exportation PDF et prise en charge multilingue"
      ],
      "contributions": [
        "Conception et implémentation des prompts IA pour la génération et l’analyse de CV",
        "Développement de la logique d’analyse de CV PDF et de comparaison avec les descriptions de poste",
        "Mise en place des retours par section et de l’analyse des écarts de mots-clés",
        "Développement de la fonctionnalité de suivi des candidatures avec persistance des données",
        "Gestion des API backend, de l’état applicatif et du rendu des modèles"
      ],
      "tech": ["React", "Express", "MongoDB", "API OpenAI", "Ant Design"],
      "links": {
        "github": "https://github.com/thomastepi/resumecraft",
        "demo": "https://resumecraft.thomastepi.com"
      },
      "meta": { "year": "2024", "status": "En ligne" }
    },

    "bookMart": {
      "title": "BookMart",
      "description": "Développement de BookMart, une application web sécurisée pour gérer des collections de livres avec connexion, recherche et opérations CRUD complètes dans une interface intuitive et réactive.",
      "longDescription": "BookMart est une application CRUD simple et rapide conçue pour la gestion d’un catalogue de livres personnel ou de petite librairie, avec recherche et filtres intégrés.",
      "features": [
        "Tableau de bord protégé par authentification",
        "Création/Lecture/Mise à jour/Suppression de livres avec images de couverture",
        "Recherche par titre/auteur et filtres par tags",
        "Validation des formulaires et mises à jour optimistes"
      ],
      "contributions": [
        "Conception du schéma de base de données et des API pour l’inventaire",
        "Développement des formulaires côté client et validation",
        "Implémentation de la pagination et des filtres de requête",
        "Mise en place d’un environnement Dockerisé pour le développement"
      ],
      "tech": ["React", "Node/Express", "MongoDB", "Docker"],
      "links": {
        "github": "https://github.com/thomastepi/bookmart",
        "demo": "https://bookmart.thomastepi.com"
      },
      "meta": { "year": "2024", "status": "Démo en ligne" }
    },

    "beautySpa": {
      "title": "Annette's Beauty & SPA",
      "description": "Création d’un site convivial pour Annette’s Beauty & SPA avec galerie de services, réservation de rendez-vous et cartes cadeaux Stripe, afin d’offrir aux clients une expérience fluide et engageante.",
      "longDescription": "Un site orienté services incluant réservation, catalogue et paiement, adapté à un salon local pour augmenter les conversions et fidéliser les clients.",
      "features": [
        "Pages services & tarifs avec médias enrichis",
        "Parcours de réservation de rendez-vous",
        "Cartes cadeaux et paiements intégrés via Stripe",
        "Galerie et témoignages"
      ],
      "contributions": [
        "Développement de l’UX de réservation et de la logique des formulaires",
        "Intégration de Stripe Checkout et de ses webhooks",
        "Optimisation SEO avec métadonnées et sitemap",
        "Déploiement avec mise en cache CDN et optimisation des images"
      ],
      "tech": ["React", "Express", "Stripe", "Chakra UI", "Vercel"],
      "links": {
        "github": "https://github.com/thomastepi/annettes-beauty-spa",
        "demo": "https://annette.thomastepi.com"
      },
      "meta": { "year": "2024", "status": "En ligne" }
    },

    "guidefox": {
      "title": "Guidefox - Outil d’Onboarding Utilisateur",
      "description": "Contribution à Guidefox, un outil open-source d’onboarding pour créer visites guidées, bulles d’aide, bannières et liens contextuels. Développement du tableau de bord, options de personnalisation et intégration backend.",
      "longDescription": "Guidefox est une alternative auto-hébergée aux suites commerciales d’onboarding. Les équipes peuvent concevoir visites, bannières, bulles et liens contextuels, puis les déployer avec un agent JS léger, sans exposer de données à des tiers.",
      "features": [
        "Tableau de bord avec permissions basées sur les rôles (admin/membre)",
        "Création et ciblage de visites, bulles, bannières, popups, liens contextuels",
        "Personnalisation de l’apparence avec aperçu en temps réel",
        "Publication versionnée avec activation/désactivation et planification",
        "Agent JS léger pour injection côté client"
      ],
      "contributions": [
        "Développement des parcours du tableau de bord pour créer/gérer les guides",
        "Implémentation des options de personnalisation (thèmes, tailles, positions)",
        "Intégration des API backend et des modèles de données",
        "Amélioration de l’accessibilité et de la compatibilité multi-navigateurs"
      ],
      "tech": ["React", "Postgres", "Sequelize", "Docker", "MUI"],
      "links": {
        "github": "https://github.com/thomastepi/guidefox",
        "demo": "https://guidefox.thomastepi.com"
      },
      "meta": { "year": "2025", "status": "Open source" }
    }
  },

  "card": {
    "githubTooltip": "GitHub",
    "websiteTooltip": "Site Web",
    "LearnMore": "En Savoir Plus",
    "techStack": "Technologies",
    "modal": {
      "features": "Fonctionnalités",
      "contributions": "Mes Contributions",
      "techStack": "Pile Technologique",
      "meta": "Informations sur le projet",
      "year": "Année",
      "status": "Statut"
    }
  },

  "articles": {
    "heading": "Articles en vedette",
    "cra_migration": {
      "title": "Migration de CRA vers Next.js App Router",
      "date": "23 juin 2025",
      "description": "Comment j'ai migré mon portfolio de CRA vers Next.js, et les problèmes que j'ai rencontrés."
    },
    "resume_ai": {
      "title": "Créer des CV plus intelligents avec l’IA et le NLP",
      "date": "19 mars 2025",
      "description": "Un aperçu de la façon dont j’ai conçu ResumeCraft pour automatiser la rédaction de CV avec OpenAI."
    }
  },

  "error": {
    "title": "Page introuvable",
    "text": "Désolé, la page que vous recherchez n'existe pas.",
    "btnText": "Retour à l'accueil"
  },

  "consent": {
    "message": "Ce site utilise des cookies de Google pour améliorer votre expérience.",
    "span": "En continuant à naviguer ou en cliquant sur « Autoriser », vous consentez à leur utilisation.",
    "policyButtonText": "En savoir plus",
    "acceptBtn": "Autoriser",
    "preferenceBtn": "Modifier les préférences",
    "manage": "Préférences de cookies"
  },

  "preferencesModal": {
    "title": "Préférences des cookies",
    "essentialLabel": "Cookies essentiels (obligatoires)",
    "analyticsLabel": "Cookies de performance",
    "essentialDescription": "Nécessaires au bon fonctionnement du site et ne peuvent pas être désactivés (par exemple, l’enregistrement de votre choix de consentement).",
    "analyticsDescription": "Utilisés pour collecter des données anonymes afin d’améliorer votre expérience (par exemple, le type d’appareil ou la taille de l’écran).",
    "saveButton": "Enregistrer les préférences"
  },
  "privacyPolicy": {
    "metadata": {
      "title": "Politique de confidentialité | Thomas Tepi",
      "description": "Cette politique de confidentialité explique comment ce site collecte, utilise et protège vos informations lorsque vous visitez mon site Web et les projets associés."
    },
    "title": "Politique de confidentialité",
    "effectiveDate": "Date d’entrée en vigueur: 31 janvier 2025",
    "introduction": {
      "title": "Introduction",
      "text": "Cette politique de confidentialité décrit comment ce site et les sous-domaines associés au domaine `thomastepi.com` collectent, utilisent et stockent des données. En continuant d’utiliser `www.thomastepi.com` ou l’un de ses sous-domaines, vous acceptez les pratiques décrites ci-dessous."
    },
    "informationCollected": {
      "title": "Données collectées",
      "subtitle": "**Google Analytics (Site principal uniquement)**",
      "description": "Google Analytics est utilisé sur `www.thomastepi.com` pour comprendre l'utilisation générale du site, mais uniquement après votre consentement.",
      "subtext": "Les données anonymisées collectées peuvent inclure:",
      "list": [
        "Informations sur l’appareil (type de navigateur, système d’exploitation, catégorie d’appareil)",
        "Localisation géographique approximative (pays, région et ville uniquement)",
        "Interactions avec le site (pages visitées, temps passé, clics, comportement de défilement)",
        "Sources de trafic (liens de référence, moteurs de recherche, visites directes)"
      ],
      "trackingParams": "Si vous cliquez sur des liens du site principal vers un sous-domaine, des paramètres de suivi peuvent être ajoutés à l’URL. Ces paramètres ne sont ni lus ni traités par les sous-domaines.",
      "identifiableInfo": "**Aucune information personnellement identifiable (PII) n’est collectée ni stockée**. Votre adresse IP est anonymisée et les données sont conservées pour une durée limitée.",
      "recaptcha": {
        "title": "**Google reCAPTCHA (Site principal & Application Resume Builder)**",
        "description": "Le site principal (`www.thomastepi.com`) via son formulaire de contact ainsi que l’application Resume Builder (`resumecraft.thomastepi.com`) via ses formulaires d’authentification (connexion / création de compte) utilisent **Google reCAPTCHA v2 Invisible** pour se protéger contre le spam et les abus.",
        "subtext": "Lorsque reCAPTCHA est déclenché, il peut collecter automatiquement des informations telles que:",
        "list": [
          "Détails sur l’appareil et le navigateur",
          "Interactions de l’utilisateur avec le site (ex. : mouvements de souris, clics, frappes au clavier)",
          "URL de référence et adresse IP"
        ],
        "note": "Ces données sont envoyées directement à Google et utilisées uniquement à des fins de vérification de sécurité.",
        "disclaimer": "Ces formulaires sont protégés par reCAPTCHA et la <privacy>Politique de confidentialité</privacy> et les <tos>Conditions d’utilisation</tos> de Google s’appliquent."
      }
    },
    "scope": {
      "title": "Portée",
      "subtitle": "Cette politique s’applique aux domaines et projets suivants:",
      "list": [
        "**Site principal:** `www.thomastepi.com`",
        "**Application de création de CV:** `resumecraft.thomastepi.com`",
        "**Sawyer Camp Farmers:** `sawyercamp.thomastepi.com`",
        "**Annette’s Beauty & SPA:** `annette.thomastepi.com`",
        "**Book Mart:** `bookmart.thomastepi.com`"
      ],
      "text": "Chaque sous-domaine peut offrir des fonctionnalités différentes, mais les principes de traitement des données restent les mêmes."
    },
    "cookies": {
      "title": "Cookies et Préférences",
      "description": "Ce site utilise une combinaison de cookies essentiels et optionnels pour améliorer votre expérience.",
      "essential": "**Cookies essentiels (toujours actifs) :**",
      "essentialList": [
        "*Préférence de langue:* Enregistre la langue que vous avez sélectionnée (par ex. anglais ou français) à l’aide d’un cookie afin que le contenu correct s’affiche sur toutes les pages et lors de vos visites.",
        "*Choix de consentement aux cookies:* Enregistre si vous avez accepté ou refusé les cookies analytiques afin que vous ne soyez pas sollicité de manière répétée.",
        "*Préférence de thème:* Enregistre votre sélection de mode clair ou sombre dans un cookie afin que votre thème choisi soit appliqué de manière cohérente sur toutes les pages et visites. Ces informations ne sont pas partagées ni envoyées à un serveur.",
        "*Cookies de sécurité reCAPTCHA:* Définis par Google reCAPTCHA pour distinguer les humains des robots et protéger les formulaires contre les abus. Ces cookies sont essentiels au bon fonctionnement des formulaires de contact et d’authentification."
      ],
      "impliedConsent": "⚠️ *Consentement implicite :* Si vous continuez à utiliser la page d’accueil sans interagir avec la bannière de cookies et que vous faites défiler au-delà d’un certain point, cela est considéré comme un consentement complet au stockage de tous les cookies, y compris ceux optionnels comme Google Analytics. Cela permet au site de fournir une expérience cohérente et de collecter, le cas échéant, des données de trafic anonymisées.",
      "optional": "**Cookies optionnels (requièrent un consentement actif) :**",
      "optionalList": [
        "*Cookies Google Analytics :* Utilisés uniquement sur le site principal pour suivre des données d’utilisation anonymisées."
      ],
      "disableNotice": "Vous pouvez désactiver les cookies via les paramètres de votre navigateur, mais cela peut affecter l’expérience utilisateur.",
      "retention": "Vos paramètres de cookies sont enregistrés pendant **90 jours**. Après cette période, il vous sera demandé de confirmer à nouveau vos préférences."
    },
    "contactForm": {
      "title": "Formulaires de contact et comptes utilisateurs",
      "subtitle": "Certains sous-domaines peuvent inclure des formulaires de contact ou des inscriptions.",
      "description": "Lorsque vous soumettez un message ou créez un compte, les informations suivantes peuvent être collectées :",
      "list": [
        "**Nom** (pour personnaliser les réponses)",
        "**Adresse e-mail** (pour vous contacter ou vous connecter)",
        "**Contenu du message ou détails du compte**"
      ],
      "storage": "Ces informations sont stockées de manière sécurisée et utilisées uniquement pour répondre à votre demande ou fournir des fonctionnalités liées au compte.",
      "retention": "Votre message est conservé pendant 6 mois pour assurer un suivi. Vous pouvez demander sa suppression à tout moment."
    },
    "guestUsers": {
      "title": "Utilisateurs invités",
      "description": "Certains projets (comme resumecraft.thomastepi.com) peuvent être utilisés sans créer de compte.",
      "subtext": "En tant qu'utilisateur invité:",
      "list": [
        "Vous **n’êtes pas obligé de vous inscrire**.",
        "Aucune **donnée personnelle n’est stockée**, sauf si vous la saisissez manuellement."
      ],
      "text": "Si vous créez un compte ultérieurement, **seules les données que vous fournissez** seront enregistrées."
    },
    "yourChoices": {
      "title": "Vos options de confidentialité",
      "description": "Vous pouvez désactiver le suivi par Google Analytics en installant l’extension officielle de désactivation:",
      "optOutLink": "Extension de désactivation Google Analytics",
      "requestDeletion": "Pour demander la suppression de vos données, veuillez envoyer un e-mail à:"
    },
    "dataRetention": {
      "title": "Durée de conservation des données",
      "description": [
        "**Données Google Analytics:** Conservées pendant **14 mois**.",
        "**Soumissions de formulaires de contact:** Conservées pendant **6 mois** pour permettre un suivi.",
        "**Comptes utilisateurs (le cas échéant):** Conservés de manière sécurisée aussi longtemps que le compte est actif."
      ]
    },
    "dataSecurity": {
      "title": "Sécurité des données",
      "description": "Des mesures de sécurité raisonnables sont mises en place pour protéger les données collectées contre tout accès non autorisé, modification ou mauvaise utilisation. Cependant, aucun système en ligne n'est totalement sécurisé."
    },
    "policyChanges": {
      "title": "Mises à jour de la politique",
      "description": "Cette politique de confidentialité peut être mise à jour occasionnellement pour refléter des changements fonctionnels, juridiques ou de service. La dernière version sera toujours disponible sur cette page."
    },
    "contact": {
      "title": "Contact",
      "description": "Pour toute question concernant cette politique de confidentialité, vous pouvez contactez:",
      "email": "contact@thomastepi.com"
    },
    "additionalInfo": {
      "title": "Informations complémentaires",
      "description": "Pour en savoir plus sur la manière dont Google Analytics collecte et traite les données, consultez :",
      "privacyLink": "Politique de confidentialité de Google"
    },
    "lastUpdated": "Dernière mise à jour: 25 septembre 2025"
  },

  "footer": {
    "sourceCodeBtnText": "Voir le code source sur GitHub",
    "privacyPolicyBtnText": "Politique de confidentialité"
  }
}
