{
  "metadata": {
    "title": "Thomas Tepi - Portfolio Développeur Web",
    "description": "Portfolio de Thomas Tepi présentant des projets de développement web, des compétences et de l'expérience en tant que développeur React.js et Node.js."
  },

  "header": {
    "home": "Accueil",
    "projects": "Projets",
    "aboutMe": "À propos",
    "contactMe": "Contact",
    "blog": "Blogues",
    "resume": "CV"
  },

  "landing": {
    "greeting": "Bonjour, je suis Thomas!",
    "title": "Développeur Full Stack | Défenseur de l'agriculture durable",
    "subTitle": "Créer des solutions numériques qui autonomisent les communautés locales et favorisent la durabilité environnementale.",
    "btnText": "Me contacter"
  },

  "alert": {
    "successHeader": "Message envoyé!",
    "errorHeader": "Oups!"
  },

  "contactMe": {
    "heading": "Envoyez-moi un message",
    "intro": "Une question, une idée de projet ou simplement envie de dire bonjour? Je serais ravi d’échanger avec vous. Remplissez le formulaire et je vous répondrai dans les plus brefs délais.",
    "required": "*",
    "optional": "(Facultatif)",
    "labels": {
      "name": "Votre Nom",
      "email": "Votre Email",
      "type": "De quoi s'agit-il?",
      "message": "Votre Message"
    },
    "placeholders": {
      "select": "-- Sélectionner --",
      "hireMe": "Collaboration sur un projet",
      "feedback": "Retour d’expérience",
      "other": "Juste un petit bonjour"
    },
    "buttons": {
      "send": "Envoyer"
    },
    "alerts": {
      "success": "{{name}}, j'ai bien reçu votre message et je vous contacterai bientôt. Un courriel de confirmation est en route vers votre boîte de réception.",
      "error": "Quelque chose s'est mal passé, veuillez réessayer plus tard!"
    },
    "validation": {
      "requiredName": "Le nom est requis.",
      "minName": "Le nom doit comporter au moins 2 caractères.",
      "maxName": "Le nom ne peut pas dépasser 100 caractères.",
      "invalidName": "Le nom ne peut contenir que des lettres, des espaces, des apostrophes et des traits d'union.",

      "requiredEmail": "L'adresse e-mail est requise.",
      "invalidEmail": "Veuillez saisir une adresse e-mail valide.",

      "invalidType": "Type de demande invalide.",

      "requiredComment": "Le message est requis.",
      "minComment": "Le message doit contenir au moins 25 caractères.",
      "maxComment": "Le message ne peut pas dépasser 1000 caractères.",
      "invalidCharacters": "Le message contient des caractères non valides.",
      "serverError": "Erreur interne du serveur. Veuillez réessayer plus tard.",
      "networkError": "Erreur réseau. Veuillez vérifier votre connexion Internet."
    },
    "privacyDisclaimer": "En soumettant ce formulaire, vous acceptez que vos informations fournies soient stockées en toute sécurité et utilisées uniquement pour répondre à votre demande, comme indiqué dans ma"
  },

  "aboutMe": {
    "heading": "À propos de moi",
    "paragraph1": "Développeur Full Stack passionné et contributeur open source, je me spécialise en React, Node.js et les frameworks modernes de développement web. Mon parcours a été dédié à la création de solutions évolutives et centrées sur l'utilisateur, avec des contributions à des projets comme",
    "paragraph2": "Je m'épanouis dans le développement de fonctionnalités, l'amélioration des interactions UI/UX et l'écriture de code clair et maintenable qui renforce la fonctionnalité et l'accessibilité des projets. Au-delà du développement, je suis également un défenseur des technologies durables et des solutions communautaires.",
    "paragraph3": "Mon expérience allie expertise technique et impact concret, que ce soit en développant des expériences numériques fluides ou en soutenant des initiatives qui autonomisent les communautés. Avec une solide base en collaboration et en résolution de problèmes, je suis déterminé à concevoir des technologies qui font la différence - aussi bien dans le numérique que dans le monde réel."
  },

  "techStack": {
    "techStackTitle": "Technologies",
    "techStackSubtitle": "Voici quelques-unes des technologies avec lesquelles j'ai de l'expérience:",
    "frontend": "Frontend",
    "backend": "Backend",
    "tools": "Outils"
  },

  "projects": {
    "heading": "Mes Projets",
    "MoreProjectsBtn": "Autres projets",
    "sawyerCamp": {
      "title": "Sawyer-Camp Farmers CIG",
      "description": "Développé et lancé un site web pour Sawyer Camp Farmers Common Initiative Group, permettant aux agriculteurs locaux au Cameroun de présenter leurs produits et leurs pratiques agricoles durables. Conception conviviale et navigation fluide pour améliorer l'expérience utilisateur."
    },
    "resumeBuilder": {
      "title": "Générateur de CV AI",
      "description": "Un générateur de CV alimenté par l'IA, offrant une plateforme sécurisée pour se connecter, mettre à jour les profils et créer des CV professionnels. Avec des modèles existants ou une personnalisation via des algorithmes avancés, ResumeCraft garantit des CV adaptés à chaque profil utilisateur."
    },
    "bookMart": {
      "title": "BookMart",
      "description": "Une application de gestion de livres sécurisée et conviviale permettant aux utilisateurs de se connecter et d'effectuer des opérations CRUD essentielles sur leur inventaire de livres. Une interface intuitive pour ajouter, mettre à jour et supprimer facilement les livres."
    },
    "beautySpa": {
      "title": "Annette's Beauty & SPA",
      "description": "Amélioration de la présence en ligne d'Annette avec un site web convivial. Les clients peuvent explorer une galerie de styles, réserver des rendez-vous et découvrir les services proposés. Achetez des cartes-cadeaux en toute sécurité grâce à Stripe. Cette plateforme complète améliore l'expérience globale des clients."
    },
    "guidefox": {
      "title": "Guidefox - Outil d’Onboarding Utilisateur",
      "description": "Guidefox est une plateforme d’onboarding open source et auto-hébergée permettant de créer des visites guidées, des indices contextuels, des liens d’aide, des bannières et des popups pour favoriser l’adoption et améliorer la découverte des fonctionnalités. Conçue pour garantir la confidentialité et une personnalisation complète, elle offre aux équipes un contrôle total sur l’expérience utilisateur, sans dépendance à un fournisseur. La plateforme dispose d’un tableau de bord administrateur basé sur les permissions, où les administrateurs et les membres invités peuvent créer, personnaliser et gérer tous les guides d’onboarding. De la définition de visites guidées étape par étape à la configuration de bannières en temps réel et à l’intégration de liens d’aide contextuels, le tableau de bord simplifie le déploiement d’expériences d’onboarding dans une application. J’ai contribué au développement du tableau de bord administrateur, en créant la logique permettant d’ajouter, de gérer et de dupliquer des guides, de personnaliser leur apparence et d’intégrer les fonctionnalités backend."
    }
  },

  "card": {
    "githubTooltip": "GitHub",
    "websiteTooltip": "Site Web",
    "isExpanded": "Afficher moins",
    "isCollapsed": "Afficher plus",
    "techStack": "Technologies"
  },

  "articles": {
    "heading": "Articles en vedette",
    "cra_migration": {
      "title": "Migration de CRA vers Next.js App Router",
      "date": "23 juin 2025",
      "description": "Comment j'ai migré mon portfolio de CRA vers Next.js, et les problèmes que j'ai rencontrés."
    },
    "resume_ai": {
      "title": "Créer des CV plus intelligents avec l’IA et le NLP",
      "date": "19 mars 2025",
      "description": "Un aperçu de la façon dont j’ai conçu ResumeCraft pour automatiser la rédaction de CV avec OpenAI."
    }
  },

  "error": {
    "title": "Page introuvable",
    "text": "Désolé, la page que vous recherchez n'existe pas.",
    "btnText": "Retour à l'accueil"
  },

  "consent": {
    "message": "J'utilise des cookies pour analyser le trafic et améliorer votre expérience de navigation.",
    "span": "En cliquant sur 'Autoriser' ou en continuant à utiliser ce site, vous acceptez l'utilisation des cookies.",
    "policyButtonText": "En savoir plus",
    "acceptBtn": "Autoriser",
    "preferenceBtn": "Modifier les préférences",
    "manage": "Préférences de cookies"
  },

  "preferencesModal": {
    "title": "Préférences des cookies",
    "essentialLabel": "Cookies essentiels (obligatoires)",
    "analyticsLabel": "Cookies de performance",
    "essentialDescription": "Nécessaires au bon fonctionnement du site et ne peuvent pas être désactivés (par exemple, l’enregistrement de votre choix de consentement).",
    "analyticsDescription": "Utilisés pour collecter des données anonymes afin d’améliorer votre expérience (par exemple, le type d’appareil ou la taille de l’écran).",
    "saveButton": "Enregistrer les préférences"
  },
  "privacyPolicy": {
    "metadata": {
      "title": "Politique de confidentialité | Thomas Tepi",
      "description": "Cette politique de confidentialité explique comment ce site collecte, utilise et protège vos informations lorsque vous visitez mon site Web et les projets associés."
    },
    "title": "Politique de confidentialité",
    "effectiveDate": "Date d’entrée en vigueur: 31 janvier 2025",
    "introduction": {
      "title": "Introduction",
      "text": "Cette politique de confidentialité décrit comment ce site et les sous-domaines associés au domaine `thomastepi.com` collectent, utilisent et stockent des données. En continuant d’utiliser `www.thomastepi.com` ou l’un de ses sous-domaines, vous acceptez les pratiques décrites ci-dessous."
    },
    "informationCollected": {
      "title": "Données collectées",
      "subtitle": "**Google Analytics (Site principal uniquement)**",
      "description": "Google Analytics est utilisé sur `www.thomastepi.com` pour comprendre l'utilisation générale du site, mais uniquement après votre consentement.",
      "subtext": "Les données anonymisées collectées peuvent inclure:",
      "list": [
        "Informations sur l’appareil (type de navigateur, système d’exploitation, catégorie d’appareil)",
        "Localisation géographique approximative (pays, région et ville uniquement)",
        "Interactions avec le site (pages visitées, temps passé, clics, comportement de défilement)",
        "Sources de trafic (liens de référence, moteurs de recherche, visites directes)"
      ],
      "trackingParams": "Si vous cliquez sur des liens du site principal vers un sous-domaine, des paramètres de suivi peuvent être ajoutés à l’URL. Ces paramètres ne sont ni lus ni traités par les sous-domaines.",
      "identifiableInfo": "**Aucune information personnellement identifiable (PII) n’est collectée ni stockée**. Votre adresse IP est anonymisée et les données sont conservées pour une durée limitée."
    },
    "scope": {
      "title": "Portée",
      "subtitle": "Cette politique s’applique aux domaines et projets suivants:",
      "list": [
        "**Site principal:** `www.thomastepi.com`",
        "**Application de création de CV:** `resumecraft.thomastepi.com`",
        "**Sawyer Camp Farmers:** `sawyercamp.thomastepi.com`",
        "**Annette’s Beauty & SPA:** `annette.thomastepi.com`",
        "**Book Mart:** `bookmart.thomastepi.com`"
      ],
      "text": "Chaque sous-domaine peut offrir des fonctionnalités différentes, mais les principes de traitement des données restent les mêmes."
    },
    "cookies": {
      "title": "Cookies et préférences",
      "description": "Ce site utilise une combinaison de cookies essentiels et de stockage local pour améliorer votre expérience.",
      "essential": "**Cookies essentiels (toujours actifs):**",
      "essentialList": [
        "*Préférence linguistique:* Enregistre la langue que vous avez choisie (ex. français ou anglais) via un cookie afin d'afficher le contenu approprié lors de vos prochaines visites.",
        "*Consentement aux cookies:* Enregistre si vous avez accepté ou refusé les cookies d’analyse afin d’éviter de vous redemander à chaque visite."
      ],
      "impliedConsent": "⚠️ *Consentement implicite:* Si vous continuez à utiliser la page d'accueil sans interagir avec la bannière de consentement et que vous faites défiler la page au-delà d’un certain point, cela est considéré comme un consentement total à l'utilisation de tous les cookies, y compris ceux facultatifs comme Google Analytics. Cela permet au site de fournir une expérience cohérente et de collecter des données de trafic anonymisées lorsque cela s'applique.",
      "optional": "**Cookies facultatifs (nécessitent un consentement actif):**",
      "optionalList": [
        "*Cookies Google Analytics:* Utilisés uniquement sur le site principal pour collecter des données d’utilisation anonymisées."
      ],
      "localStorage": "**Stockage local (préférences non liées au suivi):**",
      "localStorageList": [
        "*Préférence de thème:* Enregistre votre choix entre le mode clair et le mode sombre localement sur votre appareil. Ces données ne sont pas envoyées à un serveur."
      ],
      "disableNotice": "Vous pouvez désactiver les cookies dans les paramètres de votre navigateur, mais cela peut affecter votre expérience sur le site.",
      "retention": "Vos préférences en matière de cookies sont conservées pendant **90 jours**. Passé ce délai, une nouvelle confirmation vous sera demandée."
    },
    "contactForm": {
      "title": "Formulaires de contact et comptes utilisateurs",
      "subtitle": "Certains sous-domaines peuvent inclure des formulaires de contact ou des inscriptions.",
      "description": "Lorsque vous soumettez un message ou créez un compte, les informations suivantes peuvent être collectées :",
      "list": [
        "**Nom** (pour personnaliser les réponses)",
        "**Adresse e-mail** (pour vous contacter ou vous connecter)",
        "**Contenu du message ou détails du compte**"
      ],
      "storage": "Ces informations sont stockées de manière sécurisée et utilisées uniquement pour répondre à votre demande ou fournir des fonctionnalités liées au compte.",
      "retention": "Votre message est conservé pendant 6 mois pour assurer un suivi. Vous pouvez demander sa suppression à tout moment."
    },
    "guestUsers": {
      "title": "Utilisateurs invités",
      "description": "Certains projets (comme resumecraft.thomastepi.com) peuvent être utilisés sans créer de compte.",
      "subtext": "En tant qu'utilisateur invité:",
      "list": [
        "Vous **n’êtes pas obligé de vous inscrire**.",
        "Aucune **donnée personnelle n’est stockée**, sauf si vous la saisissez manuellement."
      ],
      "text": "Si vous créez un compte ultérieurement, **seules les données que vous fournissez** seront enregistrées."
    },
    "yourChoices": {
      "title": "Vos options de confidentialité",
      "description": "Vous pouvez désactiver le suivi par Google Analytics en installant l’extension officielle de désactivation:",
      "optOutLink": "Extension de désactivation Google Analytics",
      "requestDeletion": "Pour demander la suppression de vos données, veuillez envoyer un e-mail à:"
    },
    "dataRetention": {
      "title": "Durée de conservation des données",
      "description": [
        "**Données Google Analytics:** Conservées pendant **14 mois**.",
        "**Soumissions de formulaires de contact:** Conservées pendant **6 mois** pour permettre un suivi.",
        "**Comptes utilisateurs (le cas échéant):** Conservés de manière sécurisée aussi longtemps que le compte est actif."
      ]
    },
    "dataSecurity": {
      "title": "Sécurité des données",
      "description": "Des mesures de sécurité raisonnables sont mises en place pour protéger les données collectées contre tout accès non autorisé, modification ou mauvaise utilisation. Cependant, aucun système en ligne n'est totalement sécurisé."
    },
    "policyChanges": {
      "title": "Mises à jour de la politique",
      "description": "Cette politique de confidentialité peut être mise à jour occasionnellement pour refléter des changements fonctionnels, juridiques ou de service. La dernière version sera toujours disponible sur cette page."
    },
    "contact": {
      "title": "Contact",
      "description": "Pour toute question concernant cette politique de confidentialité, vous pouvez contactez:",
      "email": "contact@thomastepi.com"
    },
    "additionalInfo": {
      "title": "Informations complémentaires",
      "description": "Pour en savoir plus sur la manière dont Google Analytics collecte et traite les données, consultez :",
      "privacyLink": "Politique de confidentialité de Google"
    },
    "lastUpdated": "Dernière mise à jour: 23 juin 2025"
  }
}
