{
  "metadata": {
    "title": "Thomas Tepi - Web Developer Portfolio",
    "description": "Portfolio of Thomas Tepi, showcasing web development projects, skills, and experience as a React.js and Node.js developer."
  },
  "header": {
    "home": "Home",
    "projects": "Projects",
    "aboutMe": "About",
    "contactMe": "Contact",
    "blog": "Blogs",
    "resume": "Resume"
  },

  "landing": {
    "greeting": "Hello, I am Thomas!",
    "title": "Full Stack Developer | Advocate for Sustainable Agriculture",
    "subTitle": "Building digital solutions that empower local communities and drive environmental sustainability.",
    "btnText": "Get in touch"
  },

  "alert": {
    "successHeader": "All good!",
    "errorHeader": "Oops!"
  },

  "contactMe": {
    "heading": "Let's Connect",
    "intro": "Have a question, project idea, or just want to say hello? I’d love to hear from you. Fill out the form and I’ll get back to you as soon as possible.",
    "required": "*",
    "optional": "(Optional)",
    "labels": {
      "name": "Your Name",
      "email": "Your Email",
      "type": "What's this about?",
      "message": "Your Message"
    },
    "placeholders": {
      "select": "-- Select --",
      "hireMe": "Project collaboration",
      "feedback": "Feedback",
      "other": "Just saying hello"
    },
    "buttons": {
      "send": "Send"
    },
    "alerts": {
      "success": "Thanks for your submission {{name}}, I will get back to you shortly!",
      "error": "Something went wrong, please try again later!"
    },
    "validation": {
      "requiredName": "Name is required.",
      "minName": "Name must be at least 2 characters.",
      "maxName": "Name cannot exceed 100 characters.",
      "invalidName": "Name can only contain letters, spaces, apostrophes, and hyphens.",

      "requiredEmail": "Email is required.",
      "invalidEmail": "Enter a valid email address.",

      "invalidType": "Invalid inquiry type.",

      "requiredComment": "Message is required.",
      "minComment": "Message must be at least 25 characters.",
      "maxComment": "Message cannot exceed 1000 characters.",
      "invalidCharacters": "Message contains invalid characters.",
      "serverError": "Internal server error. Please try again later.",
      "networkError": "Network error. Please check your internet connection.",
      "timeoutError": "Request timed out. Please try again later."
    },
    "privacyDisclaimer": "By submitting this form, you agree that your provided information will be stored securely and used solely for responding to your inquiry, as outlined in my"
  },

  "aboutMe": {
    "heading": "About Me",
    "paragraph1": "As a passionate Full Stack Developer and Open Source Contributor, I specialize in React, Node.js, and modern web development frameworks. My journey has been dedicated to building user-centric and scalable solutions, with contributions to projects like",
    "paragraph2": "I thrive in feature development, refining UI/UX interactions, and writing clear, maintainable code that enhances project functionality and accessibility. Beyond coding, I am also an advocate for sustainable technology and community-driven solutions.",
    "paragraph3": "My experience bridges technical expertise with real-world impact, whether it's developing seamless digital experiences or supporting initiatives that empower communities. With a strong foundation in collaboration and problem-solving, I am committed to crafting technology that makes a difference - both in the digital space and beyond."
  },

  "techStack": {
    "techStackTitle": "Tech Stack",
    "techStackSubtitle": "Here are some of the technologies I have experience with:",
    "frontend": "Frontend",
    "backend": "Backend",
    "tools": "Tools"
  },

  "projects": {
    "heading": "My Work",
    "MoreProjectsBtn": "More Projects",
    "sawyerCamp": {
      "title": "Sawyer-Camp Farmers CIG",
      "description": "Developed and launched a website for Sawyer Camp Farmers Common Initiative Group, empowering local farmers in Cameroon by showcasing their products and sustainable farming practices. Implemented user-friendly design and seamless navigation to enhance user experience and engagement."
    },
    "resumeBuilder": {
      "title": "AI Resume Builder",
      "description": "An innovative AI-powered resume builder, provides a secure platform for users to log in, update their profiles, and create professional resumes. With the option to choose from existing templates or generate a personalized one using advanced AI algorithms, ResumeCraft ensures that resumes are tailored to each user's unique profile."
    },
    "bookMart": {
      "title": "BookMart",
      "description": "A secure and user-friendly book management application that allows users to log in securely and perform essential CRUD (Create, Read, Update, Delete) operations on their book inventory. With an intuitive interface, users can easily add new books, update existing entries, and remove items they no longer need."
    },
    "beautySpa": {
      "title": "Annette's Beauty & SPA",
      "description": "Transformed Annette's online presence with a user-friendly website. Clients can explore a curated gallery of styles and services, effortlessly book appointments, and discover Annette's offerings. Pamper loved ones with secure gift card purchases (powered by Stripe). This comprehensive platform enhances the overall customer experience."
    }
  },

  "card": {
    "githubTooltip": "GitHub",
    "websiteTooltip": "Website",
    "isExpanded": "Show less",
    "isCollapsed": "Read more",
    "techStack": "Tech Stack Used"
  },

  "articles": {
    "heading": "Highlighted Articles",
    "cra_migration": {
      "title": "Migrating from CRA to Next.js App Router",
      "date": "June 22, 2025",
      "description": "How I transitioned my portfolio from CRA to Next.js, and the issues I faced."
    },
    "resume_ai": {
      "title": "Building Smarter Resumes with AI and NLP",
      "date": "March 19, 2025",
      "description": "An inside look at how I designed ResumeCraft to automate resume writing using OpenAI."
    }
  },

  "error": {
    "title": "Page Not Found",
    "text": "Sorry, the page you are looking for does not exist.",
    "btnText": "Go back home"
  },

  "consent": {
    "message": "I use cookies to analyze traffic and improve your browsing experience.",
    "span": "By clicking 'Allow' or continuing to use this site, you agree to their use.",
    "policyButtonText": "Learn more",
    "acceptBtn": "Allow",
    "preferenceBtn": "Modify Preferences",
    "manage": "Cookie Preferences"
  },

  "preferencesModal": {
    "title": "Cookie Preferences",
    "essentialLabel": "Essential Cookies (required)",
    "analyticsLabel": "Performance Cookies",
    "essentialDescription": "Required for the website to function properly and cannot be disabled (e.g. saving your cookie consent choice).",
    "analyticsDescription": "Used to collect anonymous data to improve your experience (e.g. detecting your device type or screen size).",
    "saveButton": "Save Preferences"
  },

  "privacyPolicy": {
    "metadata": {
      "title": "Privacy Policy | Thomas Tepi",
      "description": "This Privacy Policy outlines how I collect, use, and protect your information when you visit my website and associated projects."
    },
    "title": "Privacy Policy",
    "effectiveDate": "Effective Date: January 31, 2025",
    "introduction": {
      "title": "Introduction",
      "text": "This Privacy Policy describes how this site and any associated subdomains under the `thomastepi.com` domain collect, use, and store data. By continuing to use `www.thomastepi.com` or any of its subdomains, you agree to the practices described below."
    },
    "informationCollected": {
      "title": "What Data Is Collected",
      "subtitle": "**Google Analytics (Main Portfolio Site Only)**",
      "description": "Google Analytics is used on `www.thomastepi.com` to understand general site usage, but only after you give consent.",
      "subtext": "Anonymized data collected may include:",
      "list": [
        "Device Information (browser type, operating system, device category)",
        "Approximate geographic location (country, region, and city level **only**)",
        "Website Interactions (pages visited, time spent, clicks, scrolling behavior)",
        "Traffic Sources (referral links, search engines, direct visits)"
      ],
      "trackingParams": "If you click links from the main site to a subdomain, tracking parameters may be added to the URL. These are not read or processed by the subdomains.",
      "identifiableInfo": "**No personally identifiable information (PII) is collected or stored**. Your IP address is anonymized, and data is retained for a limited period."
    },

    "scope": {
      "title": "Scope",
      "subtitle": "This policy applies to the following domains and projects:",
      "list": [
        "**Main Portfolio Site:** `www.thomastepi.com`",
        "**Resume Builder App:** `resumecraft.thomastepi.com`",
        "**Sawyer Camp Farmers:** `sawyercamp.thomastepi.com`",
        "**Annette's Beauty & SPA:** `annette.thomastepi.com`",
        "**Book Mart:** `bookmart.thomastepi.com`"
      ],
      "text": "Each subdomain may provide different functionality, but the core data principles outlined here remain consistent."
    },

    "cookies": {
      "title": "Cookies and Preferences",
      "description": "This site uses a combination of essential cookies and local storage to enhance your experience.",
      "essential": "**Essential Cookies (Always Active):**",
      "essentialList": [
        "*Language Preference:* Stores the language you've selected (e.g English or French) using a cookie so the correct content is shown across pages and visits.",
        "*Cookie Consent Choice:* Saves whether you’ve accepted or rejected analytics cookies so you’re not repeatedly prompted."
      ],
      "impliedConsent": "⚠️ *Implied Consent:* If you continue using the homepage without interacting with the cookie banner and scroll beyond a certain point, this is treated as full consent to store all cookies, including optional ones like Google Analytics. This allows the site to provide a consistent experience and collect anonymized traffic data where applicable.",
      "optional": "**Optional Cookies (Require Active Consent):**",
      "optionalList": [
        "*Google Analytics Cookies:* Used only on the main portfolio site to track anonymized usage data."
      ],
      "localStorage": "**Local Storage (Non-Tracking Preferences):**",
      "localStorageList": [
        "*Theme Preference:* Stores your dark or light mode selection locally. This information is not shared or sent to any server."
      ],
      "disableNotice": "You can disable cookies via your browser settings, though this may affect the user experience.",
      "retention": "Your cookie settings are saved for **90 days**. After that, you’ll be prompted to confirm your preferences again."
    },
    "contactForm": {
      "title": "Contact Forms and User Accounts",
      "subtitle": "Some subdomains may include contact forms or account registration.",
      "description": "When you submit a message or register, the following information may be collected:",
      "list": [
        "**Name** (for personalization)",
        "**Email Address** (for contact or login purposes)",
        "**Message or account details**"
      ],
      "storage": "This information is stored securely and used solely to respond to your request or provide account-related features.",
      "retention": "Your message is retained for 6 months to ensure follow-ups can be processed. You may request deletion at any time."
    },
    "guestUsers": {
      "title": "Guest Users",
      "description": "Some projects (such as resumecraft.thomastepi.com) allow usage without an account.",
      "subtext": "As a guest:",
      "list": [
        "You are **not required to register**.",
        "No **personal data is stored** unless you manually enter it."
      ],
      "text": "If you later sign up, **only the data you provide** is stored."
    },
    "yourChoices": {
      "title": "Your Privacy Options",
      "description": "You can opt out of Google Analytics tracking by installing the official Google Analytics Opt-out Browser Add-on:",
      "optOutLink": "Google Analytics Opt-out Add-on",
      "requestDeletion": "To request deletion of your submitted data, please send an email to:"
    },
    "dataRetention": {
      "title": "Data Retention",
      "description": [
        "**Google Analytics Data:** Retained for **14 months**.",
        "**Contact Form Submissions:** Retained for **6 months** for follow-ups.",
        "**User Accounts (if applicable):** Stored securely for as long as the account remains active"
      ]
    },
    "dataSecurity": {
      "title": "Data Security",
      "description": "Reasonable security measures are in place to protect collected data from unauthorized access, alteration, or misuse. However, no online system is completely immune to risks."
    },
    "policyChanges": {
      "title": "Policy Updates",
      "description": "This Privacy Policy may be updated occasionally to reflect changes in functionality, legal requirements, or services. The latest version will always be available on this page."
    },
    "contact": {
      "title": "Contact",
      "description": "For questions about this Privacy Policy, please reach out to:",
      "email": "contact@thomastepi.com"
    },
    "additionalInfo": {
      "title": "Additional Information",
      "description": "For more details about how Google Analytics collects and processes data, refer to:",
      "privacyLink": "Google’s Privacy Policy"
    },
    "lastUpdated": "Last Updated: June 23, 2025"
  }
}
